smartinou/map/projects/beastfeedher/firmware/builds/lm3s6965/BSP.cpp
// *****************************************************************************
//
// Project: PFPP
//
// Module: BSP.
//
// *****************************************************************************

//! \file
//! \brief BSP class.
//! \ingroup application_bsp

// *****************************************************************************
//
//        Copyright (c) 2016-2020, Martin Garon, All rights reserved.
//
// *****************************************************************************

// *****************************************************************************
//                              INCLUDE FILES
// *****************************************************************************

// QP Library.
#include "qpcpp.h"

// CMSIS Library.
#include "lm3s_cmsis.h"

#include "netif/lm3s/EthDrv.h"

// TI Library.
#include <inc/hw_ints.h>
//#include "inc/hw_memmap.h" // duplicated defines in lm3s_cmsis.h
#include <inc/hw_types.h>
#include <driverlib/flash.h>
#include <driverlib/gpio.h>
#include <driverlib/interrupt.h>
#include <driverlib/sysctl.h>
#include <driverlib/systick.h>
#include <driverlib/uart.h>

#include <net/EthernetAddress.h>

#include "inc/Button.h"
#include "inc/GPIO.h"

#include "FatFSDisk.h"
#include "SDC.h"
#include "SPI.h"
#include "DS3234.h"
#include "SSD1329.h"
#include "TB6612.h"

#include "Display_AOs.h"
#include "Logging_AOs.h"
#include "BLE_AOs.h"
#include "PFPP_AOs.h"
#include "RTCC_AOs.h"
#include "LwIP_AOs.h"
#include "LwIP_Events.h"

#include "PFPP_Events.h"
#include "Signals.h"
#include "IBSP.h"
#include "BSP.h"

// *****************************************************************************
//                      DEFINED CONSTANTS AND MACROS
// *****************************************************************************


// !!!!!!!!!!!!!!!!!!!!!!!!!!!!! CAUTION !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// Assign a priority to EVERY ISR explicitly by calling NVIC_SetPriority().
// DO NOT LEAVE THE ISR PRIORITIES AT THE DEFAULT VALUE!
// See NOTE00
enum KernelUnawareISRs {
    UART0_PRIO,
    // ...
    // Keep always last.
    MAX_KERNEL_UNAWARE_CMSIS_PRI
};


// "kernel-unaware" interrupts can't overlap "kernel-aware" interrupts.
Q_ASSERT_COMPILE(MAX_KERNEL_UNAWARE_CMSIS_PRI <= QF_AWARE_ISR_CMSIS_PRI);

// See NOTE00.
enum KernelAwareISRs {
    SYSTICK_PRIO = QF_AWARE_ISR_CMSIS_PRI,
    GPIOPORTA_PRIO,
    GPIOPORTE_PRIO,
    GPIOPORTF_PRIO,
    // ...
    // Keep always last.
    MAX_KERNEL_AWARE_CMSIS_PRI
};

// "kernel-aware" interrupts should not overlap the PendSV priority.
Q_ASSERT_COMPILE(MAX_KERNEL_AWARE_CMSIS_PRI <= (0xFF >>(8-__NVIC_PRIO_BITS)));


#define UART_BAUD_RATE      115200U
#ifdef Q_SPY

#define UART_TXFIFO_DEPTH   16U

#endif // Q_SPY

// *****************************************************************************
//                         TYPEDEFS AND STRUCTURES
// *****************************************************************************

namespace BSP {


class SSI0PinCfg
    : public CoreLink::SSIPinCfg {

public:
    SSI0PinCfg() : CoreLink::SSIPinCfg(0) {}
    ~SSI0PinCfg() {}

    void SetPins(void) const override {
        GPIO::EnableSysCtlPeripheral(sSSIPins.mPort);
        GPIOPinTypeSSI(
            sSSIPins.mPort,
            sSSIPins.mClkPin | sSSIPins.mRxPin | sSSIPins.mTxPin
        );

        // Set a weak pull-up on MISO pin for SD Card's proper operation.
        GPIOPadConfigSet(
            sSSIPins.mPort,
            sSSIPins.mRxPin,
            GPIO_STRENGTH_2MA,
            GPIO_PIN_TYPE_STD_WPU
        );

        GPIOPadConfigSet(
            sSSIPins.mPort,
            sSSIPins.mClkPin | sSSIPins.mTxPin,
            GPIO_STRENGTH_2MA,
            GPIO_PIN_TYPE_STD
        );
    }

private:
    // PA2: SSI0CLK
    // PA4: SSI0RX
    // PA5: SSI0TX
    static struct SSIGPIO {
        unsigned long mPort;
        unsigned int  mClkPin;
        unsigned int  mRxPin;
        unsigned int  mTxPin;
    } constexpr sSSIPins = {
        GPIO_PORTA_BASE,
        GPIO_PIN_2, // Clk.
        GPIO_PIN_4, // Rx.
        GPIO_PIN_5  // Tx.
    };
};


class Factory
    : public IBSPFactory {

public:
    virtual ~Factory() {
        // Empty Dtor.
    }


    static std::shared_ptr<IBSPFactory> Instance(void) {
        if (nullptr == Factory::mInstance.get()) {
            // Assigning the instance this way rather than with std::make_shared<>()
            // allows to make the Ctor private.
            BSP::Factory::mInstance = std::shared_ptr<IBSPFactory> (new Factory);
        }

        return Factory::mInstance;
    }


    // IBSPFactory Interface.
    std::shared_ptr<RTCC::AO::RTCC_AO> CreateRTCCAO(void) override {
        if (mRTCCAO.get() == nullptr) {
            mRTCC = CreateRTCC();
            // RTCC also implements both ITemperature and INVMem interfaces.
            mRTCCAO = std::make_shared<RTCC::AO::RTCC_AO>(*mRTCC, *mRTCC, *mRTCC);
        }
        return mRTCCAO;
    }


    // This could be used to get a temporary opaque pointer to RTCC AO,
    // For direct posting to AO for instance:
    //     QP::QActive * lPtr = GetOpaqueRTCCAO();
    //     lPtr->Post(myEvent);
    QP::QActive *GetOpaqueRTCCAO(void) const override { return mRTCCAO.get(); }


    QP::QActive *GetOpaqueBLEAO(void) const override { return mBLEAO.get(); }


    unsigned int CreateDisks(void) override {
        // This BSP has one SDC device.
        if (mSDC.get() == nullptr) {
            GPIO lCSnPin(GPIO_PORTD_BASE, GPIO_PIN_0);
            mSDC = std::make_shared<SDC>(0, *mSPIDev, lCSnPin);
        }

        return FatFSDisk::GetDiskQty();
    }


    std::shared_ptr<QP::QActive> CreateLogFileSinkAO(void) override {
        if (mFileLogSink.get() == nullptr) {
            mFileLogSink = std::make_shared<Logging::AO::FileSink_AO>();
        }
        return mFileLogSink;
    }


    std::shared_ptr<QP::QActive> CreatePFPPAO(FeedCfgRec &aFeedCfgRec) override {
        if (mPFPPAO.get() == nullptr) {
            mMotorControl = CreateMotorControl();
            mPFPPAO = std::make_shared<PFPP::AO::Mgr_AO>(*mMotorControl, &aFeedCfgRec);
        }
        return mPFPPAO;
    }


    QP::QActive *GetOpaquePFPPAO(void) const override { return mPFPPAO.get(); }


    std::shared_ptr<QP::QActive> CreateDisplayMgrAO(void) override {
        if (mDisplayMgrAO.get() == nullptr) {
            mDisplay = CreateDisplay();
            mDisplayMgrAO = std::make_shared<Display::AO::Mgr_AO>(*mDisplay);
        }
        return mDisplayMgrAO;
    }


    QP::QActive *GetOpaqueDisplayMgrAO(void) const override { return mDisplayMgrAO.get(); }


    std::shared_ptr<QP::QActive> CreateLwIPMgrAO(void) override {
        // Only one instance of this object can exist.
        if (mLwIPMgrAO.get() == nullptr) {
            // Create all Ethernet drivers required before the AO.
            // LwIP::AO::Mgr doesn't use any local references to LwIPDrv.
            // They are referenced via LwIPDrv static functions.
            CreateEthDrv();
            mLwIPMgrAO = std::make_shared<LwIP::AO::Mgr_AO>();
        }
        return mLwIPMgrAO;
    }


    std::shared_ptr<QP::QActive> CreateBLEAO(void) override {
        if (mBLE.get() == nullptr) {
            mBLE = CreateBLE();
            mBLEAO = std::make_shared<PFPP::AO::BLE_AO>(*mBLE);
        }
        return mBLEAO;
    }


    // Local interface.
    static GPIO const &GetRTCCInterruptPin(void) { return mRTCCInterruptPin; }
    static GPIO const &GetBLEInterruptPin(void) { return mBLEInterruptPin; }

    static uint8_t const sSysTick_Handler;
    static uint8_t const sGPIOPortA_IRQHandler;

