smartinou/map/projects/beastfeedher/firmware/builds/lm3s6965/BSP.cpp
private:
    Factory(const Factory&) = delete;
    Factory& operator=(const Factory&) = delete;
    explicit Factory()
        : mClkRate(0)
        , mSSIPinCfg(nullptr)
        , mSPIDev(nullptr)
        , mRTCC(nullptr)
        , mRTCCAO(nullptr)
        , mFileLogSink(nullptr)
        , mMotorControl(nullptr)
        , mPFPPAO(nullptr)
        , mDisplay(nullptr)
        , mDisplayMgrAO(nullptr)
        , mSDC(nullptr) {

        // Ctor.
        Init();

        // SPIDev is required with several devices.
        mSPIDev = std::unique_ptr<CoreLink::SPIDev>(CreateSPIDev(0));

        // TODO: CONSIDER CREATING RTCC HERE TOO.
    }


    void Init(void) {
        // NOTE: SystemInit() already called from the startup code,
        // where clock already set (CLOCK_SETUP in lm3s_config.h)
        // SystemCoreClockUpdate() also called from there.
        // Settings done for 50MHz system clock.
    #if 0
        SysCtlClockSet(
            SYSCTL_SYSDIV_1
            | SYSCTL_USE_OSC
            | SYSCTL_OSC_MAIN
            | SYSCTL_XTAL_8MHZ
        );
    #endif
        mClkRate = 50000000;

        // Enable the clock to the peripherals used by the application.

        // Enable all required GPIO.
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
        //SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
        //SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);
        //SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOH);

#ifdef Q_SPY
        // Debug UART port.
        GPIO lU0RxGPIO(GPIO_PORTA_BASE, GPIO_PIN_0);
        GPIO lU0TxGPIO(GPIO_PORTA_BASE, GPIO_PIN_1);
        SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);
        GPIOPinTypeUART(lU0RxGPIO.GetPort(), lU0RxGPIO.GetPin() | lU0TxGPIO.GetPin());
        //UARTStdioInit(0);
        // Enable UART0:
        // @115200, 8-N-1.
        // Interrupt on rx FIFO half-full.
        // UART interrupts: rx and rx-to.
        // Flush the buffers.
        UARTConfigSetExpClk(
            UART0_BASE,
            SysCtlClockGet(),
            UART_BAUD_RATE,
            (UART_CONFIG_PAR_NONE
            | UART_CONFIG_STOP_ONE
            | UART_CONFIG_WLEN_8)
        );
        UARTFIFOLevelSet(UART0_BASE, UART_FIFO_TX1_8, UART_FIFO_RX4_8);
        UARTEnable(UART0_BASE);

        // Enable interrupts.
        UARTIntDisable(UART0_BASE, 0xFFFFFFFF);
        UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
        IntEnable(INT_UART0);

        // Initialize the QS software tracing.
        if (0U == QS_INIT(nullptr)) {
            Q_ERROR();
        }
        QS_OBJ_DICTIONARY(&BSP::Factory::sSysTick_Handler);
        //QS_OBJ_DICTIONARY(&sGPIOPortA_IRQHandler);
        //QS_OBJ_DICTIONARY(&sGPIOPortC_IRQHandler);
        //QS_OBJ_DICTIONARY(&sGPIOPortD_IRQHandler);
        //QS_OBJ_DICTIONARY(&sGPIOPortF_IRQHandler);
#endif // Q_SPY
    }


    CoreLink::SPIDev * CreateSPIDev(unsigned int aSSIID) {
        switch (aSSIID) {
        case 0:
            // Create pin configuration.
            // Initialize SPI Master.
            SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI0);
            mSSIPinCfg = std::make_unique<SSI0PinCfg>();
            return new CoreLink::SPIDev(SSI0_BASE, mClkRate, *mSSIPinCfg);

        case 1:
        default:
            return nullptr;
        }
    }


    std::unique_ptr<DS3234> CreateRTCC(void) {
        // Creates a DS3234 RTCC.
        // Calls the Ctor that uses default SPI slave configuration,
        // with specified CSn pin.
        unsigned long lInterruptNumber = INT_GPIOA;
        GPIO lCSnPin(GPIO_PORTA_BASE, GPIO_PIN_7);
        auto lRTCC = std::make_unique<DS3234>(
            2000,
            lInterruptNumber,
            mRTCCInterruptPin,
            *mSPIDev,
            lCSnPin
        );

        return lRTCC;
    }

    std::unique_ptr<TB6612> CreateMotorControl(void) {
        GPIO lIn1(GPIO_PORTB_BASE, GPIO_PIN_6);
        GPIO lIn2(GPIO_PORTB_BASE, GPIO_PIN_5);
        GPIO lPWM(GPIO_PORTB_BASE, GPIO_PIN_0);

        return std::make_unique<TB6612>(lIn1, lIn2, lPWM);
    }


    std::unique_ptr<SSD1329> CreateDisplay() {
        GPIO lOLEDCSnPin(GPIO_PORTA_BASE, GPIO_PIN_3);
        GPIO lDCnPin(GPIO_PORTC_BASE, GPIO_PIN_7);
        GPIO lEn15VPin(GPIO_PORTC_BASE, GPIO_PIN_6);
        static unsigned int constexpr sDisplayWidth = 128;
        static unsigned int constexpr sDisplayHeight = 96;

        auto lDisplay = std::make_unique<SSD1329>(
            *mSPIDev,
            lOLEDCSnPin,
            lDCnPin,
            lEn15VPin,
            sDisplayWidth,
            sDisplayHeight
        );
        return lDisplay;
    }


    void CreateEthDrv(void) {
        EthernetAddress lMAC = GetMACAddress();
        unsigned int lMyNetIFIndex = 0;
        unsigned int lPBufQueueSize = 8;
        mEthDrv = std::make_unique<EthDrv>(
            lMyNetIFIndex,
            lMAC,
            lPBufQueueSize
        );
    }


    std::unique_ptr<BLE::BLE> CreateBLE(void) {
        unsigned long lInterruptNumber = INT_GPIOB;
        GPIO lCSnPin(GPIO_PORTB_BASE, GPIO_PIN_4);
        auto lBLE = std::make_unique<BLE::BLE>(
            lInterruptNumber,
            mBLEInterruptPin,
            *mSPIDev,
            lCSnPin
        );

        return lBLE;
    }


    EthernetAddress GetMACAddress(void) {
        // For the Stellaris Eval Kits, the MAC address will be stored in the
        // non-volatile USER0 and USER1 registers. These registers can be read
        // using the FlashUserGet function, as illustrated below.
        // See https://maclookup.app/vendors/texas-instruments
        // ...for MAC address lookup.
        // 00:1A:B6:XX:XX:XX is own by TI, 2012-12-12.
        unsigned long lUser0 = 0;
        unsigned long lUser1 = 0;
        FlashUserGet(&lUser0, &lUser1);

        // Convert the 24/24 split MAC address from NV ram into a 32/16 split MAC address.
        EthernetAddress lMAC(
            static_cast<uint8_t>((lUser0 & 0x000000FFL) >>  0),
            static_cast<uint8_t>((lUser0 & 0x0000FF00L) >>  8),
            static_cast<uint8_t>((lUser0 & 0x00FF0000L) >> 16),
            static_cast<uint8_t>((lUser1 & 0x000000FFL) >>  0),
            static_cast<uint8_t>((lUser1 & 0x0000FF00L) >>  8),
            static_cast<uint8_t>((lUser1 & 0x00FF0000L) >> 16)
        );

        if (lMAC.IsValid()) {
            return lMAC;
        }

