smartinou/map/projects/beastfeedher/firmware/builds/lm3s6965/BSP.cpp
    // Get the state of the GPIO and issue the corresponding event.
    static const bool lIsMasked = true;
    unsigned long lIntStatus = GPIOPinIntStatus(GPIO_PORTB_BASE, lIsMasked);
    unsigned int lPin = BSP::Factory::GetBLEInterruptPin().GetPin();
    if (lPin & lIntStatus) {
        GPIOPinIntClear(GPIO_PORTB_BASE, lPin);

        // Signal to AO that BLE generated an interrupt.
        static QP::QEvt const sBLEIntEvent(BLE_INTERRUPT_SIG);
        //QP::QF::PUBLISH(&sBLEIntEvent, 0);
        BSP::Factory::Instance()->GetOpaqueBLEAO()->POST(&sBLEIntEvent, 0);
    }
}


// GPIO port C interrupt handler.
void GPIOPortC_IRQHandler(void);
void GPIOPortC_IRQHandler(void) {

    // Get the state of the GPIO and issue the corresponding event.
    static const bool lIsMasked = true;
    unsigned long lIntStatus = GPIOPinIntStatus(GPIO_PORTC_BASE, lIsMasked);
    unsigned int lPin = BSP::mManualFeedButton.GetPin();
    if (lPin & lIntStatus) {
        GPIOPinIntClear(GPIO_PORTC_BASE, lPin);

        static PFPP::Event::Mgr::ManualFeedCmd const sOnEvent(FEED_MGR_MANUAL_FEED_CMD_SIG, true);
        static PFPP::Event::Mgr::ManualFeedCmd const sOffEvent(FEED_MGR_MANUAL_FEED_CMD_SIG, false);
        // Decouple using framework PUBLISH() method instead of direct posting to AO.
        QP::QActive * const lPFPPAO = BSP::Factory::Instance()->GetOpaquePFPPAO();
        if (nullptr != lPFPPAO) {
            if (Button::IS_HIGH == BSP::mManualFeedButton.GetGPIOPinState()) {
                //QP::QF::PUBLISH(&sOnEvent, 0);
                lPFPPAO->POST(&sOnEvent, 0);
            } else {
                //QP::QF::PUBLISH(&sOffEvent, 0);
                lPFPPAO->POST(&sOffEvent, 0);
            }
        }
    }
}


// GPIO port D interrupt handler.
void GPIOPortD_IRQHandler(void);
void GPIOPortD_IRQHandler(void) {

    // Get the state of the GPIO and issue the corresponding event.
    static const bool lIsMasked = true;
    unsigned long lIntStatus = GPIOPinIntStatus(GPIO_PORTD_BASE, lIsMasked);
    unsigned int lPin = BSP::mTimedFeedButton.GetPin();
    if (lPin & lIntStatus) {
        GPIOPinIntClear(GPIO_PORTD_BASE, lPin);
        // Only interested in the pin coming high.
        QP::QActive * const lPFPPAO = BSP::Factory::Instance()->GetOpaquePFPPAO();
        if (nullptr != lPFPPAO) {
            if (Button::IS_HIGH == BSP::mTimedFeedButton.GetGPIOPinState()) {
                static PFPP::Event::Mgr::TimedFeedCmd const sEvent(FEED_MGR_TIMED_FEED_CMD_SIG, 0);
                //QP::QF::PUBLISH(&sEvent, 0);
                lPFPPAO->POST(&sEvent, 0);
            }
        }
    }
}


// GPIO port F interrupt handler.
void GPIOPortF_IRQHandler(void);
void GPIOPortF_IRQHandler(void) {

    // Get the state of the GPIO and issue the corresponding event.
    static const bool lIsMasked = true;
    unsigned long lIntStatus = GPIOPinIntStatus(GPIO_PORTF_BASE, lIsMasked);
    unsigned int lPin = BSP::mSelectButton.GetPin();
    if (lPin & lIntStatus) {
        GPIOPinIntClear(GPIO_PORTF_BASE, lPin);
        // Only interested in the pin coming high.
        QP::QActive * const lDisplayMgrAO = BSP::Factory::Instance()->GetOpaqueDisplayMgrAO();
        if (nullptr != lDisplayMgrAO) {
            if (Button::IS_HIGH == BSP::mSelectButton.GetGPIOPinState()) {
                static QP::QEvt const sEvent(DISPLAY_REFRESH_SIG);
                lDisplayMgrAO->POST(&sEvent, 0);
            }
        }
    }
}


#ifdef Q_SPY
void UART0_IRQHandler(void);
// ISR for receiving bytes from the QSPY Back-End
// NOTE: This ISR is "QF-unaware" meaning that it does not interact with
// the QF/QK and is not disabled.
// Such ISRs don't need to call QK_ISR_ENTRY/QK_ISR_EXIT
// and they cannot post or publish events.
//
void UART0_IRQHandler(void) {
    // Get the raw interrupt status.
    // Clear the asserted interrupts.
    unsigned long lStatus = UARTIntStatus(UART0_BASE, true);
    UARTIntStatus(UART0_BASE, lStatus);

    // While RX FIFO NOT empty.
    while (UARTCharsAvail(UART0_BASE)) {
        unsigned long lLongByte = UARTCharGet(UART0_BASE);
        uint8_t lByte = static_cast<uint8_t>(lLongByte);
        QP::QS::rxPut(lByte);
    }
}
#else // Q_SPY
// Intentional undefined function body.
#endif // Q_SPY


// TODO: make this conditional to Ethernet support.
void Ethernet_IRQHandler(void);
void Ethernet_IRQHandler(void) {
    static constexpr unsigned int sIndex = 0;
    LwIPDrv::StaticISR(sIndex);
}


} // extern C

// *****************************************************************************
//                                END OF FILE
// *****************************************************************************
